'''
----type----

int: 정수
float: 실수
str: 문자열
list: 리스트
기타 등등

----입력----
input()
콘솔에서 사용자가 입력한 값을 문자열로 return

----연산자----
할당 연산자 =

다중 할당, 동시 할당
[변수1], [변수2] = [값1], [값2]
[변수1] = [변수2] = [값1]

산술 연산자
+, -, *, /, //, %, **

#복합 대입 연산자
+=, -=, *=, /=, %=, //=

관계 연산자
==, !=, <, >, <=, >=

논리 연산자
and, or, not

----조건문----
if [논리 박스]:
 들여쓰기 ->
elif [논리박스]:
 들여쓰기 ->
else:
 들여쓰기 ->

----반복문----
while [논리상자]:
 들여쓰기 ->

for [변수] in [range([시작, 끝, 증감]) / [리스트]]:
 들여쓰기 ->


----함수----
def [함수이름]([인자값1], [인자값2], [인자값3]....):
 들여쓰기 ->

----리스트----
[]


'''